from pydantic import BaseModel


class DefaultMessages(BaseModel):
    """Стандартные сообщения ответов пользователю."""

    # Общие сообщения бота
    START_BOT_MESSAGE: str = "🌍 Главное меню бота"
    CANCEL_MESSAGE: str = "❌ Отменены все действия"
    MENU_CANCEL_MESSAGE: str = "⏳ Нажмите '❌ Отмена' чтобы выйти в главное меню бота"
    OPTIONS_BOT_MESSAGE: str = "🚦 Доступные варианты"
    NOT_PHOTO_MESSAGE: str = (
        "⚠ Изображение должно быть в формате .jpg, "
        ".jpeg или .png. Скидывайте изображения снова"
    )
    
    RESULT_RESPONSE: str = "📚 Результат запроса"

    # Сообщения при сетевых ошибках
    NETWORK_ERROR: str = "🚫 Ошибка сети. Попробуйте позже."
    UNKNOWN_STATUS_ERROR: str = "🚫 Сайт вернул неожиданный ответ."
    SERVER_ERROR: str = "⚙️ Внутренняя ошибка сервера."
    TIMEOUT_ERROR: str = "⌛ Сервер не ответил вовремя."

    # Сообщения при обработках запроса пользователя
    TRY_REPSONSE_MESSAGE: str = "👣 Попробуйте, снова, сделать запрос..."
    WAIT_LONG_RESPONSE_MESSAGE: str = (
        "⏳ Обработка запроса может занять"
        " от {start} секунд до {end} минут. Пожалуйста, наберитесь терпения"
    )
    START_RESPONSE: str = "⏳ Запрос принят на обработку..."
    WAIT_MESSAGE: str = "⏳ Идет обработка запроса..."
    WAIT_AND_CANCEL_MESSAGE: str = (
        "⏳ Идет обработка запроса...Дождитесь" " обработки или нажмите Отмена"
    )

    BUTTON_CANCEL_MESSAGE: str = (
        "❌ Запрос отменен\n🚛" " Идет остановка процесса.Пожалуйста ожидайте..."
    )

    RESPONSE_WAIT_MESSAGE: str = (
        "👩‍💻 Обработка запроса:\n\n" "📥Идет обработка запроса - Ожидайте {percent} %"
    )  # Сообщение пользователю когда идет генерация видео
    END_RESPONSE_MESSAGE: str = "👩‍🔬 Обработка запроса:\n\n✅ Запрос успешно обработан"
    
    CANCEL_TEXT: str = "❌ Отмена"
    UNKNOWN_TEXT: str = "Неизвестно"
    CONFIRMATION_TEXT: str = "Подтверждаю"
    ADMIN_PANEL_TEXT: str = "Админ Панель"


class TelegramEmoji(BaseModel):
    "Модель с эмодзи для телеграм."

    digit_0: str = "0⃣"
    digit_1: str = "1⃣"
    digit_2: str = "2⃣"
    digit_3: str = "3⃣"
    digit_4: str = "4⃣"
    digit_5: str = "5⃣"
    digit_6: str = "6⃣"
    digit_7: str = "7⃣"
    digit_8: str = "8⃣"
    digit_9: str = "9⃣"

    pencil: str = "✏"
    red_cross: str = "❌"
    guitar: str = "🎸"
    planet_earth: str = "🌏"
    piano_keys: str =  "🎹"
    yellow_triangle_with_exclamation_mark: str = "⚠"


messages: DefaultMessages = DefaultMessages()
telegram_emoji: TelegramEmoji = TelegramEmoji()
